<?xml version="1.0"?>
<net name="gmcnn-places2-tf" version="11">
	<layers>
		<layer id="1" name="Placeholder" type="Parameter" version="opset1">
			<data shape="1,512,680,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Placeholder,Placeholder:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>3</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="Placeholder_1" type="Parameter" version="opset1">
			<data shape="1,512,680,1" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Placeholder_1,Placeholder_1:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="2" name="Placeholder/Transpose([0 3 1 2])/value971714288" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Placeholder/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="truediv/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="32" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="truediv/y" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="truediv/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="truediv" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="truediv:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sub/y_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="34" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sub/y" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sub/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sub:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="sub_1/x_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="36" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="sub_1/x" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sub_1/x:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Placeholder_1/Transpose([0 3 1 2])/value972114162" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Placeholder_1/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sub_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="mul:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ones_like/Const_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="36" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="17" name="ones_like/Const" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" names="ones_like/Const:0" />
			</output>
		</layer>
		<layer id="18" name="ones_like/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="ones_like/Shape/GatherNCHWtoNHWC_input_port_1/value952513898" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="38" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ones_like/Shape/GatherNCHWtoNHWC_input_port_2/value952714174" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="54" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="ones_like/Shape/GatherNCHWtoNHWC" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ones_like/Broadcast/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="ones_like/Shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="ones_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ones_like:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="62" size="32" />
			<output>
				<port id="0" precision="I64" names="strided_slice/stack:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="94" size="32" />
			<output>
				<port id="0" precision="I64" names="strided_slice/stack_1:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="126" size="32" />
			<output>
				<port id="0" precision="I64" names="strided_slice/stack_2:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="995614216" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="concat/TransposeNHWCtoNCHW" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="994414264" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="mul_1/TransposeNHWCtoNCHW" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="strided_slice:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="mul_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="concat:0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="inpaint_net/b1conv1/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 5, 7, 7" offset="158" size="15680" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="inpaint_net/b1conv1/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv1/kernel/read:0">
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="inpaint_net/b1conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv1/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="inpaint_net/b1conv1/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="15838" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="inpaint_net/b1conv1/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv1/bias/read:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="inpaint_net/b1conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="inpaint_net/b1conv1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv1/Elu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="inpaint_net/b1conv2_downsample/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 7, 7" offset="15902" size="200704" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="inpaint_net/b1conv2_downsample/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv2_downsample/kernel/read:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="inpaint_net/b1conv2_downsample/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>680</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv2_downsample/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="inpaint_net/b1conv2_downsample/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="216606" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="inpaint_net/b1conv2_downsample/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv2_downsample/bias/read:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="inpaint_net/b1conv2_downsample/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv2_downsample/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="inpaint_net/b1conv2_downsample/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv2_downsample/Elu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="inpaint_net/b1conv3/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 7, 7" offset="216734" size="401408" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="inpaint_net/b1conv3/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv3/kernel/read:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="inpaint_net/b1conv3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv3/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="inpaint_net/b1conv3/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="618142" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="inpaint_net/b1conv3/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv3/bias/read:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="inpaint_net/b1conv3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv3/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="inpaint_net/b1conv3/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv3/Elu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="inpaint_net/b1conv4_downsample/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 7, 7" offset="618270" size="802816" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="inpaint_net/b1conv4_downsample/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv4_downsample/kernel/read:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="inpaint_net/b1conv4_downsample/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>340</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv4_downsample/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="inpaint_net/b1conv4_downsample/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1421086" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="inpaint_net/b1conv4_downsample/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv4_downsample/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="inpaint_net/b1conv4_downsample/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv4_downsample/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="inpaint_net/b1conv4_downsample/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv4_downsample/Elu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="inpaint_net/b1conv5/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 7, 7" offset="1421342" size="1605632" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="inpaint_net/b1conv5/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv5/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="inpaint_net/b1conv5/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv5/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="inpaint_net/b1conv5/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="3026974" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="inpaint_net/b1conv5/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv5/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="inpaint_net/b1conv5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv5/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="inpaint_net/b1conv5/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv5/Elu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="inpaint_net/b1conv6/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 7, 7" offset="3027230" size="1605632" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="inpaint_net/b1conv6/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv6/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="inpaint_net/b1conv6/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv6/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="inpaint_net/b1conv6/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="4632862" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="inpaint_net/b1conv6/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv6/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="inpaint_net/b1conv6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv6/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="inpaint_net/b1conv6/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv6/Elu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="inpaint_net/b1conv7_atrous/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 7, 7" offset="4633118" size="1605632" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="inpaint_net/b1conv7_atrous/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv7_atrous/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="inpaint_net/b1conv7_atrous/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="2, 2" pads_begin="6, 6" pads_end="6, 6" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv7_atrous/BatchToSpaceND:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="inpaint_net/b1conv7_atrous/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="6238750" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="inpaint_net/b1conv7_atrous/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv7_atrous/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="inpaint_net/b1conv7_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv7_atrous/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="inpaint_net/b1conv7_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv7_atrous/Elu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="inpaint_net/b1conv8_atrous/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 7, 7" offset="6239006" size="1605632" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="inpaint_net/b1conv8_atrous/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv8_atrous/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="inpaint_net/b1conv8_atrous/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="4, 4" pads_begin="12, 12" pads_end="12, 12" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv8_atrous/BatchToSpaceND:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="inpaint_net/b1conv8_atrous/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="7844638" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="inpaint_net/b1conv8_atrous/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv8_atrous/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="inpaint_net/b1conv8_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv8_atrous/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="inpaint_net/b1conv8_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv8_atrous/Elu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="inpaint_net/b1conv9_atrous/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 7, 7" offset="7844894" size="1605632" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="inpaint_net/b1conv9_atrous/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv9_atrous/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="inpaint_net/b1conv9_atrous/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="8, 8" pads_begin="24, 24" pads_end="24, 24" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv9_atrous/BatchToSpaceND:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="inpaint_net/b1conv9_atrous/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="9450526" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="inpaint_net/b1conv9_atrous/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv9_atrous/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="inpaint_net/b1conv9_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv9_atrous/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="inpaint_net/b1conv9_atrous/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv9_atrous/Elu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="inpaint_net/b1conv10_atrous/kernel/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 7, 7" offset="9450782" size="1605632" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="inpaint_net/b1conv10_atrous/kernel/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv10_atrous/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="inpaint_net/b1conv10_atrous/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="16, 16" pads_begin="48, 48" pads_end="48, 48" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="inpaint_net/b1conv10_atrous/BatchToSpaceND:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="inpaint_net/b1conv10_atrous/bias/read_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="11056414" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="inpaint_net/b1conv10_atrous/bias/read" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="inpaint_net/b1conv10_atrous/bias/read:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="inpaint_net/b1conv10_atrous/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
